SPedt/src/Documents/ОтчетБухгалтеру/ОтчетБухгалтеру.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетБухгалтеру</name>
  <registerRecords>AccumulationRegister.Обмен100СПрн_Ошибки</registerRecords>
  <attributes>
    <name>СуммаВозмещаемаяПунктуВыдачи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчет</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойПунктВыдачи</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОтчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьФайлаРазбор</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьОтчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьОтчетаКД</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьОтчетаВР</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКурьерскихЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВозмещаемаяНаСайте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

SPedt/src/Enums/ТипыОбменов100сп/ТипыОбменов100сп.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбменов100сп</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВозврата</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеВозврата</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Карты</name>
  </enumValues>
  <enumValues>
    <name>Транзит</name>
  </enumValues>
  <enumValues>
    <name>СуперГруппа</name>
  </enumValues>
  <enumValues>
    <name>СуперГруппаРегистрация</name>
  </enumValues>
  <enumValues>
    <name>СуперГруппаКолено</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаПосылок</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеПристроя</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаЯндекс</name>
  </enumValues>
  <enumValues>
    <name>КурьерскаяДоставка</name>
  </enumValues>
  <enumValues>
    <name>ГруппыДоставкиЗапросОплаты</name>
  </enumValues>
  <enumValues>
    <name>ГруппыДоставкиЗапросОтсрочки</name>
  </enumValues>
  <enumValues>
    <name>ПотерянныеЗаказы</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаСправочников</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
</mdclass:Enum>

SPedt/src/Documents/ОтчетБухгалтеру/ManagerModule.bsl
Функция ПолучитьТаблицу(Параметры) Экспорт
	СхемаКомпоновкиДанных 	= Отчеты.ОтчетПоБесплатнойВыдаче.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикНастроек		= Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(
		СхемаКомпоновкиДанных.ВариантыНастроек["ОтчетПоБесплатнойВыдачеДетальный"].Настройки);

	Настройки 			= КомпоновщикНастроек.Настройки;
	Для Каждого элем Из параметры Цикл
		ПараметрДанных 					= Настройки.ПараметрыДанных.Элементы.Найти(элем.Ключ);
		ПараметрДанных.Значение 		= элем.Значение;
		ПараметрДанных.Использование	= Истина;	
	КонецЦикла;
	КомпоновщикМакета 	= Новый КомпоновщикМакетаКомпоновкиДанных;

	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, , , Тип(
		"ГенераторМакетаКомпоновкиДанных"));
		
	ВнешниеНаборыДанных = Новый Структура;
//	ВнешниеНаборыДанных.Вставить("сверка", ТЗ_Сверка);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, );

	Результат = Новый ТаблицаЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Результат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	Возврат Результат;
КонецФункции



Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	ТекстыЗапроса = Новый СписокЗначений;
	Получить_ТекстЗапроса_Обмен100СПрн_Ошибки (Запрос, ТекстыЗапроса, Регистры);
	
	ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
	
КонецПроцедуры


Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.УстановитьПараметр("Период",                        ДокументСсылка.Дата);
	Запрос.УстановитьПараметр("Номер",                         ДокументСсылка.Номер);
	Запрос.УстановитьПараметр("ИдентификаторМетаданных",       ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ПолноеИмяОбъекта()));
	Запрос.УстановитьПараметр("Комментарий",                   ДокументСсылка.Комментарий);
	Запрос.УстановитьПараметр("ПометкаУдаления",               ДокументСсылка.ПометкаУдаления);
	Запрос.УстановитьПараметр("Проведен",                      ДокументСсылка.Проведен); 
	
КонецПроцедуры



Функция Получить_ТекстЗапроса_Обмен100СПрн_Ошибки (Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "Обмен100СПрн_Ошибки";
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 

	
	ТекстЗапроса =  "
					|
					|ВЫБРАТЬ
	                |	ОтчетБухгалтеру.Ссылка.Дата КАК Период,
	                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	                |	ЗНАЧЕНИЕ(Перечисление.ТипыОбменов100сп.ВыгрузкаЯндекс) КАК типОбмена,
	                |	ОтчетБухгалтеру.Ссылка КАК Партия,
	                |	1 КАК СтрокаВПартии,
	                |	null КАК Мегаордер,
	                |	""Не отправлен отчет по бесплатной выдаче"" КАК СообщениеОшибки,
	                |	1 КАК КоличествоНеИсправленных
	                |ИЗ
	                |	Документ.ОтчетБухгалтеру КАК ОтчетБухгалтеру
	                |ГДЕ
	                |	ОтчетБухгалтеру.Ссылка = &Ссылка
	                |	И НЕ ОтчетБухгалтеру.Отправлено
					|";
	
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
КонецФункции



Функция ПолноеИмяОбъекта()
	Возврат "Документ.ОтчетБухгалтеру";
КонецФункции
